---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyDistance.GetUnitTypeId
source: html/aa6b4157-c386-1ae4-7f00-31eecea26d66.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDistance.GetUnitTypeId Method

Gets the identifier of the unit quantifying the distance property.

## Syntax (C#)
```csharp
public ForgeTypeId GetUnitTypeId()
```